package java_1.lesson_1;

/**
 * Создать пустой проект в IntelliJ IDEA и прописать метод main();
 * Выведем стандарстное "Hello, world!!!" в методе main();
 */
public class first {
    public static void main(String[] args){
        System.out.println("Hello, world!!!");
    }
}
